---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSettings
source: html/49859f18-454b-ff96-fb10-047131d0d6c4.htm
---
# StructuralSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.